In [1]:
import mysql.connector
print("Import successfully!")

Import successfully!

In [ ]:
# data = mysql.connector.connect(
#     host = "localhost",
#     user = "root",
#     password = "08023256300",
#     database = "northwind"
# )

# if data.is_connected():
#     print("Connected Successfully!")

Connected Successfully!

In [3]:
mycursor = data.cursor()

In [6]:
mycursor.execute("SHOW tables")

for i in mycursor:
    print(i)

('categories',)
('customers',)
('employees',)
('orderdetails',)
('orders',)
('products',)
('suppliers',)

In [ ]:
## Which department in New York has the most employees?
mycursor.execute("SELECT * FROM CUSTOMERS")

result = mycursor.execute

In [2]:
import mysql.connector
print("Import successfully!")

data = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "08023256300",
    database = "market"
)

mycursor = data.cursor()
print("Connect to mysql successfully!")

Import successfully!
Connect to mysql successfully!

In [3]:
mycursor.execute("SHOW TABLES")

for i in mycursor:
    print(i)

('customers',)
('departments',)
('employees',)
('persons',)

In [17]:
mycursor.execute("Describe departments")
for i in mycursor:
    print(i)

mycursor.execute("Describe employees")
for i in mycursor:
    print(i)

('dept_id', 'int', 'NO', 'PRI', None, '')
('dept_name', 'varchar(50)', 'YES', '', None, '')
('emp_id', 'int', 'NO', 'PRI', None, '')
('name', 'varchar(50)', 'YES', '', None, '')
('city', 'varchar(50)', 'YES', '', None, '')
('dept_id', 'int', 'YES', 'MUL', None, '')
('salary', 'decimal(10,2)', 'YES', '', None, '')

In [20]:
mycursor.execute("SELECT * FROM EMPLOYEES")
for i in mycursor:
    print(i)

(1, 'Alice', 'New York', 1, Decimal('60000.00'))
(2, 'Bob', 'New York', 2, Decimal('55000.00'))
(3, 'Charlie', 'Chicago', 2, Decimal('72000.00'))
(4, 'Diana', 'Boston', 3, Decimal('80000.00'))
(5, 'Ethan', 'New York', 3, Decimal('65000.00'))
(6, 'Fiona', 'Chicago', 4, Decimal('50000.00'))
(7, 'George', 'Boston', 1, Decimal('70000.00'))
(8, 'Hannah', 'New York', 4, Decimal('48000.00'))

In [22]:
# Write a query to get all employees who earn more than 60,000
mycursor.execute("SELECT name, salary FROM employees WHERE salary > 60000")

for i in mycursor:
    print(i)

('Charlie', Decimal('72000.00'))
('Diana', Decimal('80000.00'))
('Ethan', Decimal('65000.00'))
('George', Decimal('70000.00'))

In [ ]:
#Write a query to list all employees ordered by salary in descending order (highest to lowest)

mycursor.execute("SELECT name, salary FROM employees ORDER BY salary DESC")

for i in mycursor:
    print(i)

('Diana', Decimal('80000.00'))
('Charlie', Decimal('72000.00'))
('George', Decimal('70000.00'))
('Ethan', Decimal('65000.00'))
('Alice', Decimal('60000.00'))
('Bob', Decimal('55000.00'))
('Fiona', Decimal('50000.00'))
('Hannah', Decimal('48000.00'))

In [26]:
# Write a query to get all employees who live in New York and show their name and salary only
mycursor.execute("SELECT name, salary, city FROM employees WHERE city = 'New York'")
# db = mycursor.fetchall()
# print(db)
for i in mycursor:
    print(i)

('Alice', Decimal('60000.00'), 'New York')
('Bob', Decimal('55000.00'), 'New York')
('Ethan', Decimal('65000.00'), 'New York')
('Hannah', Decimal('48000.00'), 'New York')

In [27]:
mycursor.execute("SELECT * FROM departments")
for i in mycursor:
    print(i)

(1, 'HR')
(2, 'Finance')
(3, 'IT')
(4, 'Marketing')

In [28]:
# ðŸ‘‰ Write a query to get each employeeâ€™s name, salary, and their department name (joining employees with departments).
mycursor.execute(''' 
    SELECT E.name, D.dept_name, E.salary 
        FROM employees E JOIN departments D
        ON E.dept_id = D.dept_id
''')
for i in mycursor:
    print(i)

('Alice', 'HR', Decimal('60000.00'))
('George', 'HR', Decimal('70000.00'))
('Bob', 'Finance', Decimal('55000.00'))
('Charlie', 'Finance', Decimal('72000.00'))
('Diana', 'IT', Decimal('80000.00'))
('Ethan', 'IT', Decimal('65000.00'))
('Fiona', 'Marketing', Decimal('50000.00'))
('Hannah', 'Marketing', Decimal('48000.00'))

In [ ]:
# Write a query to find the average salary in each department, showing the department name and the average salary

mycursor.execute('''
    SELECT D.dept_name, avg(E.salary) AS Avg_salary
         FROM departments D JOIN employees E
        ON D.dept_id = E.dept_id 
        GROUP BY D.dept_name       
''')

for i in mycursor:
    print(i)

('HR', Decimal('65000.000000'))
('Finance', Decimal('63500.000000'))
('IT', Decimal('72500.000000'))
('Marketing', Decimal('49000.000000'))

In [33]:
# Find the highest salary in each department, showing the department name and the max salary
mycursor.execute('''
    SELECT D.dept_name, max(E.salary) AS MAX_salary 
        FROM departments D JOIN employees E
            ON E.dept_id = D.dept_id
    GROUP BY D.dept_name ORDER BY  MAX_salary DESC
''')

for i in mycursor:
    print(i)

('IT', Decimal('80000.00'))
('Finance', Decimal('72000.00'))
('HR', Decimal('70000.00'))
('Marketing', Decimal('50000.00'))

In [44]:
# Find the average salary of employees in each city, but only include cities where the average salary is greater than 60,000
mycursor.execute('''
    SELECT city, avg(salary) AS avg_salary 
        FROM employees GROUP BY city
    HAVING avg(salary) > 60000
''')
for i in mycursor:
    print(i)

('Chicago', Decimal('61000.000000'))
('Boston', Decimal('75000.000000'))

In [10]:
# Find the total salary paid per department, but only include departments where the total salary is above 120,000
mycursor.execute('''
    SELECT D.dept_name, sum(salary) AS Total_Salary
        FROM departments D JOIN employees E
        ON D.dept_id = E.dept_id 
    GROUP BY D.dept_name  
        HAVING sum(salary) > 120000
''')
# x = mycursor.fetchall()
# print(x)
# for i in x:
#     print(x)
for i in mycursor:
    print(i)

('HR', Decimal('200000.00'))
('Finance', Decimal('127000.00'))
('IT', Decimal('245000.00'))

In [2]:
import mysql.connector
print("Import successfully!")

write = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "08023256300",
    database = "job_postings_fact"
)

mycursor = write.cursor()
print("Connected successfully!")

Import successfully!
Connected successfully!

In [3]:
import random
import datetime

In [4]:
job_titles = ["Data Analyst", "Software Engineer", "Cybersecurity Specialist",
              "Financial Analyst", "Project Manager", "Product Manager",
              "HR Specialist", "Marketing Analyst", "Business Analyst", "DevOps Engineer"]
companies = ["Google", "Amazon", "Microsoft", "Meta", "Tesla",
             "IBM", "Netflix", "Apple", "Oracle", "Intel"]

locations = ["New York", "San Francisco", "Chicago", "Boston", "Seattle",
             "Los Angeles", "Austin", "Washington DC", "Miami", "Denver"]

for i in range(100):
    job_title = random.choice(job_titles)
    company = random.choice(companies)
    location = random.choice(locations)
    salary = round(random.uniform(50000, 150000), 2)
    posted_date = datetime.date(2024, random.randint(1, 12), random.randint(1, 20))  # random Sept 2025 dates

    mycursor.execute("""
        INSERT INTO job_postings(job_title, company_name, job_location, salary, job_posted_date)
        VALUES (%s, %s, %s, %s, %s)
    """, (job_title, company, location, salary, posted_date))

write.commit()
print("Inserted 100 job postings successfully!")

Inserted 100 job postings successfully!

In [5]:
mycursor.execute("SELECT * FROM job_postings LIMIT 5")

for i in mycursor:
    print(i)

(1, 'Data Analyst', 'Tesla', 'San Francisco', Decimal('143932.30'), datetime.date(2024, 9, 16))
(2, 'Software Engineer', 'Microsoft', 'Miami', Decimal('129884.88'), datetime.date(2024, 4, 13))
(3, 'Product Manager', 'Netflix', 'Miami', Decimal('75395.53'), datetime.date(2024, 3, 9))
(4, 'Cybersecurity Specialist', 'Amazon', 'Seattle', Decimal('124856.51'), datetime.date(2024, 1, 5))
(5, 'Business Analyst', 'Google', 'Washington DC', Decimal('149704.69'), datetime.date(2024, 10, 7))

In [13]:
mycursor.execute('''
    SELECT count(job_id) AS job_posted_count,
        EXTRACT(MONTH FROM job_posted_date) AS Month
    FROM job_postings
        WHERE job_title = "Data Analyst"
        GROUP BY Month ORDER BY job_posted_count limit 5   
''')

for i in mycursor :
    print(i)

(2, 11)
(2, 4)
(2, 6)
(3, 12)
(3, 10)

In [15]:
mycursor.execute('''
    SELECT * FROM job_postings
        WHERE EXTRACT(month from job_posted_date) = 1
        LIMIT 5
''')

for i in mycursor:
    print(i)

(4, 'Cybersecurity Specialist', 'Amazon', 'Seattle', Decimal('124856.51'), datetime.date(2024, 1, 5))
(16, 'Software Engineer', 'Intel', 'Chicago', Decimal('120111.05'), datetime.date(2024, 1, 11))
(19, 'Data Analyst', 'Intel', 'New York', Decimal('63670.76'), datetime.date(2024, 1, 8))
(21, 'Financial Analyst', 'Oracle', 'Washington DC', Decimal('83871.67'), datetime.date(2024, 1, 15))
(27, 'Financial Analyst', 'Oracle', 'Los Angeles', Decimal('56644.69'), datetime.date(2024, 1, 19))

In [16]:
mycursor.execute('''
    CREATE TABLE january_jobs AS
    SELECT * FROM job_postings
        WHERE EXTRACT(month from job_posted_date) = 1
        
''')
print("january jobs successful")

# for i in mycursor:
#     print(i)

january jobs successful